In [3]:
import pandas as pd

In [57]:
s=pd.Series(list("abcdef"),index=[0,1,2,3,4,5])  # give index by user chioce
print (s)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [87]:
s.loc [4] # get value by index

'e'

In [75]:
s.iloc [3]

'd'

In [77]:
s.loc[0:2]

0    a
1    b
2    c
dtype: object

In [79]:
s.iloc[0:3]

0    a
1    b
2    c
dtype: object

In [93]:
import numpy as np

In [103]:
s1=pd.Series (np.random.random(5))
s2=pd.Series (np.random.random(5))
a=pd.DataFrame ([s1,s2])
a

          0         1         2         3         4
0  0.518043  0.875659  0.749677  0.736271  0.817086
1  0.024961  0.379833  0.652844  0.301541  0.491627

In [107]:
a.iloc[0] # to get full details from row

0    0.518043
1    0.875659
2    0.749677
3    0.736271
4    0.817086
Name: 0, dtype: float64

In [166]:
data ['Gender'] = ["male","female","other"]
data

   Age  Salary  Gender
0   22   50000    male
1   24   70000  female
2   19   90000   other

In [180]:
data.loc[3]=[20,60000,"Female"]  # to add new roe
data

   Age  Salary  Gender
0   22   50000    male
1   24   70000  female
2   19   90000   other
3   20   60000  Female